## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 9 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.admin will be destroyed
  - resource "aws_iam_role_policy_attachment" "admin" {
      - id         = "AWSSentinelConnectorLayerTerraformAdministratorRole-20220203202502684300000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "AWSSentinelConnectorLayerTerraformAdministratorRole" -> null
    }

  # aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:18" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-10-19T17:37:43.811+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:18" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "ENOh6T3zJwY8ibyqsv7nUYL/3YhidxVbHhq9b4MwMgk=" -> "cnojWRjbSK3ljBnHEB1EMLYfsoA1c5qJOnGArZk0rfg=" # forces replacement
      ~ source_code_size            = 10327936 -> (known after apply)
      ~ version                     = "18" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version_permission.lambda_layer_permission must be replaced
-/+ resource "aws_lambda_layer_version_permission" "lambda_layer_permission" {
      ~ id             = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer,18" -> (known after apply)
      ~ layer_name     = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply) # forces replacement
      ~ policy         = jsonencode(
            {
              - Id        = "default"
              - Statement = [
                  - {
                      - Action    = "lambda:GetLayerVersion"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:18"
                      - Sid       = "shared-layer-permission"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ revision_id    = "9d8fe038-53ef-4a66-992e-f03a3ccb307e" -> (known after apply)
      ~ version_number = 18 -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.attach_tf_plan_policy.aws_iam_policy.this will be destroyed
  - resource "aws_iam_policy" "this" {
      - arn       = "arn:aws:iam::283582579564:policy/TFPlan" -> null
      - id        = "arn:aws:iam::283582579564:policy/TFPlan" -> null
      - name      = "TFPlan" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:283582579564:table/terraform-state-lock-dynamo"
                      - Sid      = "AllowAllDynamoDBActionsOnAllTerragruntTables"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::aws-sentinel-connection-layer-tf/*",
                          - "arn:aws:s3:::aws-sentinel-connection-layer-tf",
                        ]
                      - Sid      = "AllowAllS3ActionsOnTerragruntBuckets"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecretVersionIds",
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:*"
                      - Sid      = "AllowReadingSecrets"
                    },
                  - {
                      - Action   = "secretsmanager:ListSecrets"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ListSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAUEBWWYNWPW4RCLHKJ" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.attach_tf_plan_policy.aws_iam_role_policy_attachment.readonly will be destroyed
  - resource "aws_iam_role_policy_attachment" "readonly" {
      - id         = "AWSSentinelConnectorLayerTerraformReadOnlyRole-20220203202502699700000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess" -> null
      - role       = "AWSSentinelConnectorLayerTerraformReadOnlyRole" -> null
    }

  # module.attach_tf_plan_policy.aws_iam_role_policy_attachment.this will be destroyed
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "AWSSentinelConnectorLayerTerraformReadOnlyRole-20220203202459733800000001" -> null
      - policy_arn = "arn:aws:iam::283582579564:policy/TFPlan" -> null
      - role       = "AWSSentinelConnectorLayerTerraformReadOnlyRole" -> null
    }

  # module.gh_oidc_roles.aws_iam_openid_connect_provider.github will be destroyed
  - resource "aws_iam_openid_connect_provider" "github" {
      - arn             = "arn:aws:iam::283582579564:oidc-provider/token.actions.githubusercontent.com" -> null
      - client_id_list  = [
          - "sts.amazonaws.com",
        ] -> null
      - id              = "arn:aws:iam::283582579564:oidc-provider/token.actions.githubusercontent.com" -> null
      - tags            = {
          - "CostCentre" = "SRE"
          - "Terraform"  = "true"
          - "managed_by" = "AFT"
        } -> null
      - tags_all        = {
          - "CostCentre" = "SRE"
          - "Terraform"  = "true"
          - "managed_by" = "AFT"
        } -> null
      - thumbprint_list = [
          - "6938fd4d98bab03faadb97b34396831e3780aea1",
        ] -> null
      - url             = "token.actions.githubusercontent.com" -> null
    }

  # module.gh_oidc_roles.aws_iam_role.this[0] will be destroyed
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::283582579564:role/AWSSentinelConnectorLayerTerraformReadOnlyRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - token.actions.githubusercontent.com:sub = "repo:cds-snc/aws-sentinel-connector-layer:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::283582579564:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-02-03T20:15:38Z" -> null
      - force_detach_policies = false -> null
      - id                    = "AWSSentinelConnectorLayerTerraformReadOnlyRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::283582579564:policy/TFPlan",
          - "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "AWSSentinelConnectorLayerTerraformReadOnlyRole" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "aws-sentinel-connection-layer"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "aws-sentinel-connection-layer"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROAUEBWWYNWJLJBJIJMS" -> null

      - inline_policy {}
    }

  # module.gh_oidc_roles.aws_iam_role.this[1] will be destroyed
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::283582579564:role/AWSSentinelConnectorLayerTerraformAdministratorRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - token.actions.githubusercontent.com:sub = "repo:cds-snc/aws-sentinel-connector-layer:ref:refs/heads/main"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::283582579564:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-02-03T20:24:58Z" -> null
      - force_detach_policies = false -> null
      - id                    = "AWSSentinelConnectorLayerTerraformAdministratorRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "AWSSentinelConnectorLayerTerraformAdministratorRole" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "aws-sentinel-connection-layer"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "aws-sentinel-connection-layer"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROAUEBWWYNWKJWLL5BZW" -> null

      - inline_policy {}
    }

Plan: 2 to add, 0 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
